from aiogram.types import Message

commands_list_ukrainian = """
📋 **Доступні команди:**

🔹 **/start** - Запустіть бота та отримайте початкові інструкції. Працює тільки в приватних повідомленнях з ботом.
   *Використання:* `/start`
   *Пояснення:* Ця команда ініціює взаємодію з ботом і надає початкові інструкції по налаштуванню.

🔹 **/asana** - Основна команда для взаємодії з Asana.
   *Використання:* `/asana [деталі задачі]`
   *Пояснення:* Ця команда створює задачу в Asana з наданими деталями.
   **Можлива інформація:** Назва задачі, Дата, Виконавці, Опис
   *Формати:*
     - **Назва задачі** - Перша частина повідомлення, виключаючи дату та виконавців, розглядається як назва задачі.
     - **до dd.mm.yyyy** - Вкажіть дату завершення.
     - **`@assignee_telegram_username`** - Призначте задачу комусь з групи.
     - **Опис** - Все, що після нового рядка (\\n) вважається описом задачі.
   *Загальний приклад:* 
     - `Назва задачі до 25.12.2024 @user1 @user2\nОпис задачі.`
     - `Купити продукти до 15.07.2024 @john_doe\nНе забудьте купити молоко і хліб.`

🔹 **/asana complete** - Повідомте, що задачу завершено.
   *Використання:* `/asana complete`
   *Пояснення:* Ця команда показує всі ваші задачі, що мають бути виконані сьогодні або прострочені. Виберіть задачу, щоб повідомити про її завершення.

🔹 **/asana duetoday** - Перелік задач, які потрібно виконати сьогодні.
   *Використання:* `/asana duetoday`
   *Пояснення:* Ця команда показує всі ваші задачі, які мають бути виконані сьогодні.

🔹 **/asana link** - Встановіть робочий простір за замовчуванням.
   *Використання:* `/asana link`
   *Пояснення:* Ця команда проведе вас через процес встановлення робочого простору за замовчуванням, де створюватимуться нові задачі.

🔹 **/asana help** - Показати це повідомлення.
   *Використання:* `/asana help`
   *Пояснення:* Ця команда показує повідомлення з допомогою з усіма доступними командами та їх поясненнями.

🔹 **/asana stickers** - Увімкнути або вимкнути стікери.
   *Використання:* `/asana stickers`
   *Пояснення:* Ця команда вмикає або вимикає використання стікерів ботом.

📝 **Команди тільки для приватних повідомлень:**

🔹 **stop** - Скасувати авторизацію в Asana та зупинити інтеграцію.
   *Використання:* `stop`
   *Пояснення:* Ця команда відкликає ваш токен Asana і зупиняє інтеграцію з Asana.

🔹 **delete** - Видалити ваш обліковий запис з бази даних бота.
   *Використання:* `delete`
   *Пояснення:* Ця команда видаляє інформацію про ваш обліковий запис з бази даних бота.

📌 **Примітка:** У групових чатах ви повинні використовувати префікс /asana перед командами, щоб бот їх розпізнав. У приватних повідомленнях ви можете використовувати команди без префіксу /asana. Усі команди з групового розділу працюють у приватних повідомленнях без префіксу /asana.
"""


async def process_help_command(message: Message):
    await message.answer(commands_list_ukrainian, parse_mode="Markdown")
